{
	"en": {
    "name": "Jaime Huerta",
    "title": "QA Engineer | Web, Mobile & API Testing | Automation & Data Validation | IT Infrastructure Engineer",
   
	"aboutTitle": "About Me",
    "aboutText": "QA Engineer with hands-on experience across web, mobile, backend, and data layers. I specialize in manual and automated testing, API validation, and production data analysis, helping teams deliver stable, scalable, and reliable software.",
    
	"projectsTitle": "Projects",
    "urTitle": "Urban Routes – Ride rental Web Application.",
    "urcontextTitle": "Context",
	  "urContext": "Urban Routes is a web-based transportation platform designed to allow users to request rides, calculate routes, and manage trip details in real time. The objective of this project was to validate the functional stability, usability, and data integrity of the application before release.",
    "uranalysisTitle":"Analysis",
	  "urAnalysis": "I performed end-to-end manual testing of core user flows, including route calculation, pricing logic, and ride requests. API testing was conducted using Postman to validate request/response structures, HTTP status codes, and error handling. I also executed boundary value analysis and equivalence partitioning to ensure input validation and system robustness.",
	"urconclusionsTitle":"Results",
	  "urConclusions": "The testing process identified several UI inconsistencies and API validation issues related to incorrect status codes and missing error messages. These findings helped improve system reliability and enhanced the overall user experience. This project strengthened my skills in functional testing, API validation, and defect reporting.",
    "ur_tools_title": "Tools & Techniques",
    "ur_tool_1": "Chrome DevTools – Manual UI inspection of the booking form.",
    "ur_tool_2": "Equivalence Partitioning and Boundary Value Analysis – Test design techniques applied to the vehicle booking functionality.",
    "ur_tool_3": "Checklists – Used to validate the 'Payment Method' and 'Add Card' functionalities.",
    "ur_tool_4": "JIRA – Defect tracking and bug management tool.",


	"ugTitle": "Urban Grocers – Grocery API.",
   "ugcontextTitle":"Context",
	  "ugContext": "Urban Grocers is an online grocery delivery platform that processes customer orders, inventory data, and delivery schedules. The goal of this project was to ensure data accuracy across the backend systems and verify that business rules were correctly implemented", 
    "uganalysisTitle":"Analysis",
	  "ugAnalysis": "I validated backend data using SQL endpoints to compare database records against expected business logic. API testing was performed to confirm correct data transmission between services. I also analyzed production-like datasets to identify inconsistencies, missing values, and incorrect calculations that could impact order fulfillment.",
    "ugconclusionsTitle":"Results",
	  "ugConclusions":"The project revealed multiple data integrity issues that could have resulted in incorrect order totals and inventory mismatches. By documenting these findings and proposing validation improvements, system accuracy and reliability were significantly improved. This project reinforced my experience in backend testing, data analysis, and SQL-based validation.",
    "ug_tools_title": "Tools & Techniques",
      "ug_tool_1": "Postman – API Endpoint validation for adding products, and calculating delivery times and costs",
      "ug_tool_2": "SQL – Data validation and consistency checks",
      "ug_tool_3": "Test cases & Regression Testing – Core user flows and edge cases",
		
	  "experienceTitle": "Experience",
	  "expTitle1" : "QA Engineer — Urban Projects",
	  "expDescription1": "Manual and automated testing for web, mobile, and API platforms. Regression, usability, API validation, and production data analysis.",
	  "expTitle2": "IT Infrastructure Engineer — Confie Holding Co.",
	  "expDescription2": "Managed Windows/Linux servers, Active Directory, virtualization, and enterprise infrastructure.",
	  
	"skillsTitle": "Skills",
    "skillsList": "Manual Testing, Regression, API Testing, Python, Selenium, Postman, SQL, Linux, Git, Jira",
	
	"contact_title": "Contact",
    "contact_email": "Email: huerta.jaime@gmail.com",
    "contact_linkedin": "LinkedIn: linkedin.com/in/huerta-jaime",
    "contact_github": "GitHub: github.com/huertajaime"
  }
  "es": {
    "name": "Jaime Huerta",
    "title": "Ingeniero QA | Pruebas Web, Móvil y API | Automatización y Validación de Datos | Ingeniero de Infraestructura",
    
	"aboutTitle": "Acerca de mi",
    "aboutText": "Ingeniero QA con experiencia práctica en pruebas web, móviles, backend y capas de datos. Me especializo en pruebas manuales y automatizadas, validación de APIs, y analisis de datos de produccion ayudando equipos a la entrega de software confiable, estable y escalable.",
    
	"projectsTitle": "Proyectos",
    "urTitle": "Urban Routes – Aplicacion Web para solicitar viajes",
    "urcontextTitle":"Contexto",
	  "urContext": "Urban Routes es una plataforma de transporte web diseñada que permite a usuarios solicitar viajes, calcular rutas y gestionar los detalles en tiempo real. El objetivo de este proyecto fue validar la estabilidad funcional, la usabilidad y la integridad de los datos de la aplicación antes de su lanzamiento.",
    "uranalysisTitle":"Análisis",
	  "urAnalysis":"Realicé pruebas manuales integrales de los flujos de usuario principales, incluyendo el cálculo de rutas, la lógica de precios y las solicitudes de viajes. Las pruebas de API se realizaron con Postman para validar las estructuras de solicitud/respuesta, los códigos de estado HTTP y la gestión de errores. También realicé análisis de valores límite y particionamiento de clases de equivalencia para garantizar la validación de la entrada y la robustez del sistema.",
	"urconclusionsTitle":"Resultado",
	  "urConclusions":"El proceso de pruebas identificó varias inconsistencias en la interfaz de usuario y problemas de validación de la API relacionados con códigos de estado incorrectos y mensajes de error ausentes. Estos hallazgos ayudaron a mejorar la fiabilidad del sistema y la experiencia general del usuario. Este proyecto fortaleció mis habilidades en pruebas funcionales, validación de la API y generación de informes de defectos.",	  
	"ur_tools_title": "Herramientas & Tecnicas",
      "ur_tool_1": "Chrome DevTools – Inspección manual de la UI para el formulario de reserva.",
      "ur_tool_2": "Partición de clases de equivalencia y Análisis de valores límite – Técnicas de diseño de pruebas para la funcion reserva de automoviles.",
      "ur_tool_3": "Listas de comprobacion - para validar las funciones 'Metodo de pago' y 'Agregar tarjeta'",
	  "ur_tool_4": "JIRA – Herramienta de seguimiento de defectos y gestión de bugs.",
	  
	  "ugTitle": "Urban Grocers –  API para solicitar despensa.",
    "ugcontextTitle":"Contexto",
	  "ugContext": "Urban Grocers es una plataforma de entrega de comestibles en línea que procesa pedidos de clientes, datos de inventario y horarios de entrega. El objetivo de este proyecto era garantizar la precisión de los datos en todos los sistemas administrativos y verificar que las reglas de negocio se implementaran correctamente.",
    "uganalysisTitle":"Análisis",
	  "ugAnalysis":"Validé los datos del backend utilizando endpoints SQL para comparar los registros de la base de datos con la lógica de negocio esperada. Se realizaron pruebas de API para confirmar la correcta transmisión de datos entre servicios. También analicé conjuntos de datos similares a los de producción para identificar inconsistencias, valores faltantes y cálculos incorrectos que pudieran afectar el cumplimiento de pedidos.",
	"ugconclusionsTitle":"Resultado",
	  "ugConclusions":"El proyecto reveló múltiples problemas de integridad de datos que podrían haber resultado en totales de pedidos incorrectos y discrepancias de inventario. Al documentar estos hallazgos y proponer mejoras de validación, la precisión y la fiabilidad del sistema mejoraron significativamente. Este proyecto reforzó mi experiencia en pruebas de backend, análisis de datos y validación basada en SQL.",
	"ug_tools_title": "Tools & Techniques",
      "ug_tool_1": "Postman – Validacion de endpoints para agregar productos, y calculo de costos y tiempos de entrega",
      "ug_tool_2": "SQL – Validación de datos y comprobaciones de consistencia",
      "ug_tool_3": "Casos de pruebas y de regresión: flujos de usuario principales y casos extremos",
	  
    "experienceTitle": "Experiencia",
	 "expTitle1" : "QA Engineer — Proyectos para Urban",
	  "expDescription1": "Pruebas manuales y automatizadas, para aplicaciones web, moviles y plataformas API. Regresion, operabilidad, validacion de API's y analisis de datos de produccion.",
	  "expTitle2": "Ingeniero de Infraestructura en TI — Confie Holding Co.",
	  "expDescription2": "Manejo de Servidores Windows/Linux, Active Directory, virtualizacion e infraestructura empresarial",
	  
	"skillsTitle": "Habilidades",
    "skillsList": "Pruebas manuales, regresión, pruebas de APIs, Python, Selenium, Postman, SQL, Linux, Git, Jira",
	
	"contact_title": "Contacto",
    "contact_email": "Correo: huerta.jaime@gmail.com",
    "contact_linkedin": "LinkedIn: linkedin.com/in/huerta-jaime",
    "contact_github": "GitHub: github.com/huertajaime"
  }
}






























